#1 Фикстура (fixture) в tests — это функция, которая подготавливает данные для теста.


# 2  Параметризация — одна функция, но запускается с разными данными
# Обычный тест — одна функция проверяет один сценарий


# 3 session.add() - добавляет в бд
# session.commit() - сохраняет изменения

# 4  = Пример связи один-ко-многимcars = relationship('Car', back_populates='dealer')
# dealer = relationship('CarDealer', back_populates='cars')

# 5 Блочные - это многострочный тег <div>
# строчный - в однй строке <a>

# 6 - font-family = задает семейство шрифтов , напрример шрифт - Areal


# 7 = Это система сетки, состоящая из колонок,
# которая используется для создания адаптивных и
# гибких макетов, позволяет выравнивать элементы на странице и
# управлять их размерами

# 8 = подключаем через CDN, копируем и ставим в html- код

# 9 Bluiprint = это как роуторе в aiogram
#10 когда переходят на сраницу происходит Get запрос, это цепочка, где запрос пользователя превращается в удобные объекты Python, обрабатывается кодом и возвращается браузеру примерно так
